pysigep/templates/BuscaEventos.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:res="http://resource.webservice.correios.com.br/">
    <soapenv:Header/>
    <soapenv:Body>
        <res:buscaEventosLista>
            <usuario>{{ usuario }}</usuario>
            <senha>{{ senha }}</senha>
            <tipo>L</tipo>
            <resultado>T</resultado>
            <lingua>101</lingua>
            {% for objeto in objetos %}
            <objetos>{{ objeto }}</objetos> 
            {% endfor %}
        </res:buscaEventosLista>
    </soapenv:Body>
</soapenv:Envelope>
